# Pandas
### Dataframe --- Special Object to data in tabular form(rows or columns)

In [1]:
import numpy as np
import pandas as pd

In [6]:
user_data = {
    "Marks_A":np.random.randint(1,100,7),
    "Marks_B":np.random.randint(100,200,7),
    "Marks_C":np.random.randint(200,300,7)
}

In [7]:
user_data

{'Marks_A': array([ 6, 91, 23, 81, 42, 36, 94]),
 'Marks_B': array([187, 176, 116, 133, 142, 168, 136]),
 'Marks_C': array([202, 281, 260, 226, 222, 251, 279])}

In [12]:
df = pd.DataFrame(user_data,dtype='float32')
print(df)

   Marks_A  Marks_B  Marks_C
0      6.0    187.0    202.0
1     91.0    176.0    281.0
2     23.0    116.0    260.0
3     81.0    133.0    226.0
4     42.0    142.0    222.0
5     36.0    168.0    251.0
6     94.0    136.0    279.0

In [13]:
df.head()

   Marks_A  Marks_B  Marks_C
0      6.0    187.0    202.0
1     91.0    176.0    281.0
2     23.0    116.0    260.0
3     81.0    133.0    226.0
4     42.0    142.0    222.0

In [14]:
df.head(n=3)

   Marks_A  Marks_B  Marks_C
0      6.0    187.0    202.0
1     91.0    176.0    281.0
2     23.0    116.0    260.0

In [15]:
df.to_csv('marks.csv')

In [16]:
my_data = pd.read_csv('marks.csv')

In [17]:
my_data

   Unnamed: 0  Marks_A  Marks_B  Marks_C
0           0      6.0    187.0    202.0
1           1     91.0    176.0    281.0
2           2     23.0    116.0    260.0
3           3     81.0    133.0    226.0
4           4     42.0    142.0    222.0
5           5     36.0    168.0    251.0
6           6     94.0    136.0    279.0

In [19]:
my_data = my_data.drop(columns=['Unnamed: 0'])

In [20]:
my_data

   Marks_A  Marks_B  Marks_C
0      6.0    187.0    202.0
1     91.0    176.0    281.0
2     23.0    116.0    260.0
3     81.0    133.0    226.0
4     42.0    142.0    222.0
5     36.0    168.0    251.0
6     94.0    136.0    279.0

In [21]:
my_data.describe()

         Marks_A     Marks_B     Marks_C
count   7.000000    7.000000    7.000000
mean   53.285714  151.142857  245.857143
std    35.183871   26.028373   30.129878
min     6.000000  116.000000  202.000000
25%    29.500000  134.500000  224.000000
50%    42.000000  142.000000  251.000000
75%    86.000000  172.000000  269.500000
max    94.000000  187.000000  281.000000

In [22]:
my_data.tail()

   Marks_A  Marks_B  Marks_C
2     23.0    116.0    260.0
3     81.0    133.0    226.0
4     42.0    142.0    222.0
5     36.0    168.0    251.0
6     94.0    136.0    279.0

In [23]:
df.iloc[3]

Marks_A     81.0
Marks_B    133.0
Marks_C    226.0
Name: 3, dtype: float32

In [24]:
df.iloc[3,1]

133.0

In [25]:
df.iloc[3][1]

133.0

In [26]:
my_data.sort_values(by=["Marks_A"],ascending=True)

   Marks_A  Marks_B  Marks_C
0      6.0    187.0    202.0
2     23.0    116.0    260.0
5     36.0    168.0    251.0
4     42.0    142.0    222.0
3     81.0    133.0    226.0
1     91.0    176.0    281.0
6     94.0    136.0    279.0

In [28]:
data_array = my_data.values

In [29]:
data_array

array([[  6., 187., 202.],
       [ 91., 176., 281.],
       [ 23., 116., 260.],
       [ 81., 133., 226.],
       [ 42., 142., 222.],
       [ 36., 168., 251.],
       [ 94., 136., 279.]])

In [30]:
## Converting array back into dataframe
new_df = pd.DataFrame(data_array,dtype='int32',columns=["Physics","Chemistry","Maths"])

In [32]:
new_df

   Physics  Chemistry  Maths
0        6        187    202
1       91        176    281
2       23        116    260
3       81        133    226
4       42        142    222
5       36        168    251
6       94        136    279

In [33]:
new_df.to_csv('PCM.csv')

In [46]:
pcm_df = pd.read_csv('PCM.csv')
pcm_df = pcm_df.drop(columns=['Unnamed: 0'])

In [47]:
pcm_df

   Physics  Chemistry  Maths
0        6        187    202
1       91        176    281
2       23        116    260
3       81        133    226
4       42        142    222
5       36        168    251
6       94        136    279